# t = (3, 5, 6, 1, 8)
# t_2 = tuple(sorted(t, reverse=True))
# print(t_2)
# print(type(t_2))
###############

# t = (3, 5, 6, 1, 8)
# t_2 = t[::-1]               # Срез
# print(t_2)
# print(type(t_2))

###############
# t = (3, 5, 6, 1, 8)
# t_2 = t[:len(t) // 2]
# t_3 = t[len(t) // 2:]
#
# print(t_2)
# print(t_3)


###################################### 1
# Напишите программу, которая преобразует список в кортеж и кортеж обратно в список.

# list_1 = [1, 2, 3, 4]
# print(type(list_1))
# korteg = tuple(list_1)
# print(type(korteg))
# list_1 = list(korteg)
# print(type(list_1))

###################################### 2
# Напишите программу, которая находит минимальный и максимальный элементы в кортеже

# list_1 = (1, 2, 3, 4)
# print(f"Максимальный: {max(list_1)} Минимальный: {min(list_1)}")

###################################### 3
# Напишите программу, которая подсчитывает количество определенного элемента в кортеже.

# tuple_1 = (1, 2, 3, 4, 2, 5, 2)
# count_1 = 0
# for i in tuple_1:
#     if 5 == i:
#         count_1 += 1
# print(count_1)

###################################### 4
# Напишите программу, которая меняет порядок элементов в кортеже на обратный

# tuple_1 = (1, 2, 3, 4, 2, 5, 2)
# t = tuple_1[::-1]
# print(t)

###################################### 5
# Напишите программу, которая сортирует кортеж в порядке возрастания.

# tuple_1 = (1, 2, 3, 4, 2, 5, 2)
# t = sorted(tuple_1)
# print(t)

###################################### 6
# Напишите программу, которая извлекает подкортеж из исходного кортежа

# def text_kortej(start, end, tuple_1):
#     return tuple_1[start:end]
#
#
# print(text_kortej(1, 6, (1, 2, 3, 4, 2, 5, 2)))

###################################### 7
# Напишите программу, которая объединяет несколько кортежей в один.

# def summa_kortej(*tuple_1):
#     s = []
#     for i in tuple_1:
#         s.extend(i)
#
#     return tuple(s)
#
#
# print(summa_kortej(('f', 'g', 'h'), ('i', 'k', 'g', 'b'), ('t', 'a', 'x', 'g', 'm'), ('2', 'g', '1')))

###################################### 8
# Напишите программу, которая проверяет, присутствует ли определенный элемент в кортеже.
# def symbol_kortej(x, tuple_1):
#     if x in tuple_1:
#         return True
#     else:
#         return False
#
#
# print(symbol_kortej('i', ('i', 'k', 'g', 'b')))


###################################### 9
# Напишите программу, которая преобразует кортеж в строку и наоборот.
# def tuple_in_list(tuple_1):
#     s_1 = []
#     for i in tuple_1:
#         s_1.append(str(i))
#     str_1 = ",".join(s_1)
#     return str_1
#
#
# print(type(tuple_in_list((4, 5))))


# def list_in_tuple(list_1):
#     return tuple(list_1)
#
#
# print(type(list_in_tuple([4, 5])))

###################################### 10
# Напишите программу, которая разделяет кортеж на два кортежа в заданной позиции
#
# def two_kartej(x, tup):
#     s_1 = tup[:x]
#     s_2 = tup[x:]
#     return s_1, '-', s_2
#
#
# print(two_kartej(8, (2, 3, 4, 5, 6, 6, 7)))

###################################### 11
#Есть три кортежа целых чисел необходимо найти элементы, которые есть во всех кортежах
# def elements_search(a, b, c):
#     s = []
#     for i in a:
#         if i in b and i in c:
#             s.append(i)
#
#     return s
#
#
# print(elements_search((2, 3, 5), (4, 1, 3), (3, 6, 7)))

###################################### 12
#Есть три кортежа целых чисел необходимо найти элементы, которые уникальны для каждого списка

# def elements_search(a, b, c):
#     s = []
#     for i in a:
#         if i not in b and i not in c:
#             s.append(i)
#     for j in b:
#         if j not in a and j not in c:
#             s.append(j)
#     for k in c:
#         if k not in a and k not in b:
#             s.append(k)
#
#     return s
#
#
# print(elements_search((2, 3, 5), (4, 1, 3), (3, 6, 7)))


###################################### 13
#Есть три кортежа целых чисел необходимо найти элементы, которые есть в каждом из картежей и находится в каждом из кортежей
#на той же позиции

def elements_search(a, b, c):
    s = []
    for i in range(len(a)):
        if a[i] == b[i] == c[i]:
            s.append(a[i])

    return s


print(elements_search((2, 3, 5), (4, 3, 7), (1, 3, 7)))

